USE Championship;
GO

DROP TABLE IF EXISTS Players;

CREATE TABLE Players (
	id INT CONSTRAINT PK_Players_id PRIMARY KEY IDENTITY (1, 1),
	[name] VARCHAR(45) NOT NULL,
	surname VARCHAR(45) NOT NULL,
	birthday DATE NOT NULL,
	country VARCHAR(45) NOT NULL,
	cost INT NOT NULL,
	id_position INT NOT NULL,
	id_team INT NOT NULL,
	CONSTRAINT FK_Players_id_position FOREIGN KEY (id_position) REFERENCES Positions (id) ON DELETE CASCADE,
	CONSTRAINT FK_Players_id_team FOREIGN KEY (id_team) REFERENCES Teams (id) ON DELETE CASCADE
);

INSERT INTO Players ([name], surname, birthday, country, cost, id_position, id_team)
VALUES
('Юрій', 'Паньків', '1984-11-03', 'Україна', 300000, 1, 12),
('Олександр', 'Бандура', '1985-05-30', 'Україна', 200000, 1, 12),
('Роман', 'Гагун', '1993-07-16', 'Україна', 300000, 2, 12),
('Мар"ян', 'Мисик', '1996-10-02', 'Україна', 400000, 2, 12),
('Максим', 'Білий', '1990-06-21', 'Україна', 400000, 2, 12),
('Фабрісіо', 'Альваренга', '1996-01-17', 'Аргентина', 300000, 2, 12),
('Мілош', 'Стаменковіч', '1990-06-01', 'Сербія', 300000, 2, 12),
('Валерій', 'Федорчук', '1988-10-05', 'Україна', 400000, 3, 12),
('Юрій', 'Климчук', '1997-05-05', 'Україна', 400000, 3, 12),
('Орест', 'Кузик', '1995-04-17', 'Україна', 300000, 3, 12),
('Остап', 'Притула', '2000-06-24', 'Україна', 200000, 3, 12),
('Таллес', 'Бренер Де Паула', '1998-05-12', 'Бразилія', 200000, 3, 12),
('Богдан', 'Бойчук', '1996-05-30', 'Україна', 400000, 3, 12),
('Данііл', 'Кондраков', '1998-01-19', 'Україна', 300000, 4, 12),
('Андрій', 'Борячук', '1996-04-23', 'Україна', 400000, 4, 12),
('Денис', 'Сидоренко', '1989-04-18', 'Україна', 200000, 1, 16),
('Максим', 'Коваленко', '2002-05-02', 'Україна', 50000, 1, 16),
('Євген', 'Ткачук', '1991-06-27', 'Україна', 300000, 2, 16),
('Іван', 'Коваленко', '1999-03-10', 'Україна', 50000, 2, 16),
('Віталій', 'Єрмаков', '1992-06-07', 'Україна', 400000, 2, 16),
('Соломон', 'Кверквелія', '1992-02-06', 'Грузія', 2500000, 2, 16),
('Амар', 'Квакіч', '2002-10-30', 'Боснія і Герцеговина', 200000, 2, 16),
('Юрій', 'Батюшин', '1992-12-07', 'Україна', 400000, 3, 16),
('Ростислав', 'Русин', '1995-10-26', 'Україна', 300000, 3, 16),
('Андрій', 'Ременюк', '1999-02-03', 'Україна', 100000, 3, 16),
('Євген', 'Протасов', '1997-07-23', 'Україна', 250000, 3, 16),
('Фабіо Алешандре', 'Фрейтас де Алмейда', '1996-07-07', 'Бразилія', 300000, 3, 16),
('Дерек Фрейтас', 'Рібейро', '1997-12-02', 'Бразилія', 200000, 3, 16),
('Віталій', 'Пономар', '1990-05-31', 'Україна', 300000, 4, 16),
('Ілля', 'Зубков', '1998-04-21', 'Україна', 75000, 4, 16),
('Марлісон', 'Консейсау Олівейра', '1997-12-17', 'Бразилія', 200000, 4, 16 ),






