CREATE DATABASE Championship;

USE Championship;
GO

DROP TABLE IF EXISTS Coaches;

CREATE TABLE Coaches (
    id INT CONSTRAINT PK_Coaches_id PRIMARY KEY IDENTITY(1, 1),
    [name] VARCHAR(45) NOT NULL,
    surname VARCHAR(45) NOT NULL,
    birthday DATE NOT NULL,
    country VARCHAR(45) NOT NULL
);

INSERT INTO Coaches ([name], surname, birthday, country)
VALUES 
('Мірча', 'Луческу', '1945-07-29', 'Румунія'),
('Роберто', 'Дзербі', '1979-06-06', 'Італія'),
('Остап', 'Маркевич', '1978-04-04', 'Україна'),
('Ігор', 'Леонов', '1967-09-14', 'Україна'),
('Юрій', 'Максимов', '1968-12-08', 'Україна'),
('Ігор', 'Йовичевич', '1973-11-30', 'Хорватія'),
('Сергій', 'Лавриненко', '1975-02-17', 'Україна'),
('Юрій', 'Мороз', '1970-08-08', 'Україна'),
('Віктор', 'Скрипник', '1969-11-19', 'Україна'),
('Юрій', 'Гура', '1976-08-08', 'Казахстан'),
('Олег', 'Дулуб', '1965-09-20', 'Білорусь'),
('Леонід', 'Кучук', '1959-08-27', 'Білорусь'),
('Олександр', 'Рябоконь', '1964-02-21', 'Україна'),
('Юрій', 'Вірт', '1974-05-04', 'Україна'),
('Сергій', 'Кузнецов', '1979-10-03', 'Білорусь'),
('Валерій', 'Кривенцов', '1973-07-30', 'Україна');
