USE Championship;
GO

DROP TABLE IF EXISTS Teams;

CREATE TABLE Teams (
	id INT IDENTITY(1, 1) PRIMARY KEY,
	[name] VARCHAR(45) NOT NULL,
	city VARCHAR(45) NOT NULL,
	founded DATE NOT NULL,
	CONSTRAINT PK_Teams_id PRIMARY KEY (id)
);

INSERT INTO Teams ([name], city, founded)
VALUES 
('Динамо', 'Київ', '1927-05-13'),
('Шахтар', 'Донецьк', '1936-05-24'),
('Маріуполь', 'Маріуполь', '1960-01-01'),
('Минай', 'Ужгород', '2015-01-01'),
('Ворскла', 'Полтава', '1955-01-01'),
('Дніпро-1', 'Дніпро', '2017-03-10'),
('Інгулець', 'Петрове', '2013-01-01'),
('Чорноморець', 'Одеса', '1936-01-01'),
('Зоря', 'Луганськ', '1923-05-05'),
('Олександрія', 'Олександрія', '1948-01-01'),
('Львів', 'Львів', '2006-01-01'),
('Рух', 'Львів', '2003-01-01'),
('Десна', 'Чернігів', '1960-01-01'),
('Верес', 'Рівне', '1957-01-01'),
('Колос', 'Ковалівка', '2012-01-01'),
('Металіст 1925', 'Харків', '2016-08-17');



